tutorials/CFD/26CompressibleUnSteadyNSRhoPimple/system/ITHACAdict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      ITHACAdict;
}

// EigenValue solver, can be eigen or spectra
EigenSolver eigen;

// Number of modes to output and to use for projection
NmodesUout 70;
NmodesUproj 5;
///
NmodesPout 90;
NmodesPproj 10;
///
NmodesEout 70;
NmodesEproj 40;
///
NmodesNutOut 60;
NmodesNutProj 30;

// Output format to save market vectors.
OutPrecision 20;
OutType fixed;

// Value to be assigned to x internal field for init cond
UIFinit 170;

// Number of geometries to be solved
OffNum 50;
OnNum 20;

// Bool to decide if middle solutions are to be exported
middleExport true;

// Distance between exported middle snapshots
middleStep 20;
//middleStepInit 4;

startTime 0;
finalTime 0.15;
writeEvery 4e-04;



